[{"term":"IPv4","definition":"Internet Protocol version 4 (IPv4) é a quarta versão do protocolo de Internet (IP). Utiliza endereços de 32 bits e é amplamente utilizado para identificar dispositivos em uma rede."},{"term":"IPv6","definition":"Internet Protocol version 6 (IPv6) é a versão mais recente do protocolo de Internet (IP). Utiliza endereços de 128 bits, proporcionando um número muito maior de endereços IP únicos em comparação ao IPv4."},{"term":"ARP (Address Resolution Protocol)","definition":"Protocolo usado para mapear endereços IP para endereços MAC em uma rede local Ethernet. Permite que dispositivos em uma rede descubram os endereços físicos uns dos outros."},{"term":"NDP (Neighbor Discovery Protocol)","definition":"Protocolo usado em redes IPv6 para descobrir outros dispositivos na rede e determinar seus endereços MAC. Funciona de maneira semelhante ao ARP no IPv4."},{"term":"ICMP (Internet Control Message Protocol)","definition":"Protocolo utilizado para enviar mensagens de erro e operações de controle em redes IP. Existem versões específicas para IPv4 (ICMPv4) e IPv6 (ICMPv6)."},{"term":"DHCP (Dynamic Host Configuration Protocol)","definition":"Protocolo usado para fornecer configurações de rede automaticamente para dispositivos em uma rede. DHCPv4 é usado para IPv4 e DHCPv6 para IPv6."},{"term":"SLAAC (Stateless Address Autoconfiguration)","definition":"Método em IPv6 que permite a configuração automática de endereços IP sem a necessidade de um servidor DHCP. Utiliza prefixos de rede anunciados por roteadores locais."},{"term":"IPv6 Header","definition":"Cabeçalho do pacote IPv6 que inclui campos como Version, Traffic Class, Flow Label, Payload Length, Next Header, Hop Limit, Source Address e Destination Address."},{"term":"IPv4 Header","definition":"Cabeçalho do pacote IPv4 que inclui campos como Version, IHL, Type of Service, Total Length, Identification, Flags, Fragment Offset, Time to Live (TTL), Protocol, Header Checksum, Source Address e Destination Address."},{"term":"Unicast","definition":"Responsável por identificar unicamente uma interface de rede."},{"term":"Multicast","definition":"é utilizado para identificar um grupo de interfaces."},{"term":"Anycast","definition":"é utilizado para identificar um grupo de interfaces, mas diferente do Multicast, o pacote destinado à um endereço Anycast é entregue somente à interface mais próxima da origem, enquanto o Multicast entrega a todos os participantes do grupo."},{"term":"TCP (Transmission Control Protocol)","definition":"Protocolo de transporte orientado à conexão que garante a entrega ordenada e confiável de um fluxo de bytes entre aplicações rodando em hosts comunicantes."},{"term":"UDP (User Datagram Protocol)","definition":"Protocolo de transporte sem conexão que permite a transmissão de datagramas sem garantia de entrega, ordem ou proteção contra duplicação."},{"term":"Portas TCP/UDP","definition":"São identificadores numéricos usados para distinguir diferentes serviços ou aplicações em um host. Portas comuns incluem 80 para HTTP, 443 para HTTPS, 53 para DNS, etc."},{"term":"Três vias de handshaking do TCP","definition":"Processo de estabelecimento de conexão TCP que inclui três passos"},{"term":"Padrões Ethernet","definition":"Conjunto de tecnologias de rede e especificações padronizadas pelo IEEE para comunicação em redes locais (LAN)."}]